ft = '''тимур запретил букву а
тимур зпретил букву б
тимур зпретил укву в
тимур зпретил уку е
тимур зпртил уку з
тимур пртил уку и
тмур пртл уку к
тмур пртл уу л
тмур прт уу м
тур прт уу п
тур рт уу р
ту т уу т
у уу у'''

ftm = '''тимур запретил букву а
тимур зпретил букву б
тимур зпретил укву в
тимур зпретил уку е
тимур зпртил уку з
тимур пртил уку и
тмур пртл уку к
тмур пртл уу л
тмур прт уу м
тур прт уу п
тур рт уу р
ту т уу т
у  уу у'''

lst_1 = ft.split('\n')
lst_1_m = ftm.split('\n')

for i in range(len(lst_1)):
    if lst_1[i] != lst_1_m[i]:
        print(lst_1[i], lst_1_m[i])
